; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	thermograph0 - mode
	image3 - mode
	infrared4 - mode
	infrared2 - mode
	image1 - mode
	spectrograph5 - mode
	Star0 - direction
	GroundStation1 - direction
	GroundStation2 - direction
	GroundStation3 - direction
	GroundStation5 - direction
	GroundStation8 - direction
	Star9 - direction
	Star10 - direction
	Star11 - direction
	Star12 - direction
	Star6 - direction
	Star13 - direction
	GroundStation4 - direction
	GroundStation7 - direction
	Planet14 - direction
	Phenomenon15 - direction
	Star16 - direction
	Star17 - direction
)
(:init
	(supports instrument0 thermograph0)
	(supports instrument0 spectrograph5)
	(supports instrument0 infrared4)
	(supports instrument0 image1)
	(calibration_target instrument0 Star6)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet14)
	(supports instrument1 infrared2)
	(supports instrument1 infrared4)
	(supports instrument1 thermograph0)
	(supports instrument1 image3)
	(calibration_target instrument1 GroundStation7)
	(calibration_target instrument1 GroundStation4)
	(calibration_target instrument1 Star13)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation3)
)
(:goal (and
	(pointing satellite0 GroundStation1)
	(have_image Planet14 infrared4)
	(have_image Planet14 thermograph0)
	(have_image Phenomenon15 spectrograph5)
	(have_image Phenomenon15 image1)
	(have_image Star16 image3)
	(have_image Star17 infrared2)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 7
2. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 7
3. (turn_to satellite1 star16 groundstation3)
   deleted: (pointing satellite1 groundstation3)
   added: (pointing satellite1 star16)
   goals met: 0 of 7
4. (turn_to satellite0 star6 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 star6)
   goals met: 0 of 7
5. (calibrate satellite0 instrument0 star6)
   added: (calibrated instrument0)
   goals met: 0 of 7
6. (turn_to satellite0 groundstation1 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 groundstation1)
   goals met: 1 of 7
7. (turn_to satellite1 star13 star16)
   deleted: (pointing satellite1 star16)
   added: (pointing satellite1 star13)
   goals met: 1 of 7
8. (calibrate satellite1 instrument1 star13)
   added: (calibrated instrument1)
   goals met: 1 of 7
9. (turn_to satellite1 planet14 star13)
   deleted: (pointing satellite1 star13)
   added: (pointing satellite1 planet14)
   goals met: 1 of 7
10. (take_image satellite1 planet14 instrument1 infrared4)
   added: (have_image planet14 infrared4)
   goals met: 2 of 7
11. (take_image satellite1 planet14 instrument1 thermograph0)
   added: (have_image planet14 thermograph0)
   goals met: 3 of 7
12. (turn_to satellite1 star16 planet14)
   deleted: (pointing satellite1 planet14)
   added: (pointing satellite1 star16)
   goals met: 3 of 7
13. (take_image satellite1 star16 instrument1 image3)
   added: (have_image star16 image3)
   goals met: 4 of 7
14. (turn_to satellite1 star17 star16)
   deleted: (pointing satellite1 star16)
   added: (pointing satellite1 star17)
   goals met: 4 of 7
15. (take_image satellite1 star17 instrument1 infrared2)
   added: (have_image star17 infrared2)
   goals met: 5 of 7
16. (turn_to satellite0 phenomenon15 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 phenomenon15)
   goals met: 4 of 7
17. (take_image satellite0 phenomenon15 instrument0 image1)
   added: (have_image phenomenon15 image1)
   goals met: 5 of 7
18. (take_image satellite0 phenomenon15 instrument0 spectrograph5)
   added: (have_image phenomenon15 spectrograph5)
   goals met: 6 of 7
19. (turn_to satellite0 groundstation1 phenomenon15)
   deleted: (pointing satellite0 phenomenon15)
   added: (pointing satellite0 groundstation1)
   goals met: 7 of 7
